// Задача 63: Сформировать трёхмерный массив с неповторяющимися 
// двузначными числами и вывести его на экран построчно, с индексами элементов.
Console.WriteLine("Hello, World!");
